# Library_Search.py
import os
# ============================================================================================
#     등 록 날 짜          제    목            글 쓴 이        출 판 사        장 르        상 태
# ============================================================================================
Library_list =[['2024-08-22', '인공지능', '이명수', '햇빛기획', '스릴러', '불량'], ['2024-08-22', '인공지능', '이명순', '햇빛기획', '스릴러', '불량']] #도서 출력 예시



# Library_Search
# - 도서 검색기능 (제목, 글쓴이, 출판사, 장르 4개중 1개 선택)
# ===============================================================================
#         제    목                글 쓴 이        출 판 사        장 르
# ===============================================================================

def Library_Search():
    name = input("도서검색(제목, 글쓴이, 출판사, 장르): ")
    num = 0
    print("="*70)
    print("{:^10}{:^17}{:^15}{:^17}".format("제   목", "글 쓴 이", "출 판 사", "장 르"))
    print("="*70)
    for i in range(len(Library_list)):
        if name == Library_list[i][1] or name == Library_list[i][2] or name == Library_list[i][3] or name == Library_list[i][4]:
            print("{:^10}{:^15}{:^15}{:^15}".format(Library_list[i][1], Library_list[i][2], Library_list[i][3], Library_list[i][4]))
            num = num+1
    if num == 0:
        os.system("cls")
        print("찾고자 하는 결과가 없습니다.")
        return

            
Library_Search() # 테스트
